; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_1 ?v5 - type_3 ?v2 - type_1)
 	      (pred_3 ?v7 - object ?v2 - type_1)
	      (pred_2 ?v5 - type_3 ?v3 - type_2)
	      (pred_4 ?v5 - type_3 ?v7 - object ?v3 - type_2))

   (:action op_1
       :parameters  (?v5 - type_3 ?v8 ?v4 - type_1)
       :precondition (and  (pred_1 ?v5 ?v8))
       :effect (and  (pred_1 ?v5 ?v4)
		     (not (pred_1 ?v5 ?v8))))

   (:action op_2
       :parameters (?v5 - type_3 ?v1 - object ?v6 - type_1 ?v3 - type_2)
       :precondition  (and  (pred_3 ?v1 ?v6) (pred_1 ?v5 ?v6) (pred_2 ?v5 ?v3))
       :effect (and (pred_4 ?v5 ?v1 ?v3)
		    (not (pred_3 ?v1 ?v6)) 
		    (not (pred_2 ?v5 ?v3))))

   (:action op_3
       :parameters (?v5 - type_3 ?v1 - object ?v6 - type_1 ?v3 - type_2)
       :precondition  (and  (pred_4 ?v5 ?v1 ?v3) (pred_1 ?v5 ?v6))
       :effect (and (pred_3 ?v1 ?v6)
		    (pred_2 ?v5 ?v3)
		    (not (pred_4 ?v5 ?v1 ?v3)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_03 - type_3
obj_01 obj_04 - type_2
obj_09 obj_07 obj_08 - type_1
obj_02 obj_05 obj_06 - object)
(:init
(pred_1 obj_03 obj_09)
(pred_2 obj_03 obj_01)
(pred_2 obj_03 obj_04)
(pred_3 obj_02 obj_08)
(pred_3 obj_05 obj_09)
(pred_3 obj_06 obj_07)
)
(:goal
(and
(pred_3 obj_02 obj_09)
(pred_3 obj_05 obj_09)
(pred_3 obj_06 obj_08)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_4 obj_03 ?b obj_04))))
)
)

; plan
1. (op_1 obj_03 obj_09 obj_07)
   deleted: (pred_1 obj_03 obj_09)
   added: (pred_1 obj_03 obj_07)
   goals met: 1 of 3
2. (op_2 obj_03 obj_06 obj_07 obj_01)
   deleted: (pred_3 obj_06 obj_07) (pred_2 obj_03 obj_01)
   added: (pred_4 obj_03 obj_06 obj_01)
   goals met: 1 of 3
3. (op_1 obj_03 obj_07 obj_08)
   deleted: (pred_1 obj_03 obj_07)
   added: (pred_1 obj_03 obj_08)
   goals met: 1 of 3
4. (op_3 obj_03 obj_06 obj_08 obj_01)
   deleted: (pred_4 obj_03 obj_06 obj_01)
   added: (pred_3 obj_06 obj_08) (pred_2 obj_03 obj_01)
   goals met: 2 of 3
5. (op_2 obj_03 obj_02 obj_08 obj_01)
   deleted: (pred_3 obj_02 obj_08) (pred_2 obj_03 obj_01)
   added: (pred_4 obj_03 obj_02 obj_01)
   goals met: 2 of 3
6. (op_1 obj_03 obj_08 obj_09)
   deleted: (pred_1 obj_03 obj_08)
   added: (pred_1 obj_03 obj_09)
   goals met: 2 of 3
7. (op_3 obj_03 obj_02 obj_09 obj_01)
   deleted: (pred_4 obj_03 obj_02 obj_01)
   added: (pred_3 obj_02 obj_09) (pred_2 obj_03 obj_01)
   goals met: 3 of 3
